{"modelTopology": {"training_config": {"metrics": ["mean_absolute_error"], "loss": "mean_squared_error", "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 0.009999999776482582, "momentum": 0.0, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.2", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "batch_input_shape": [null, 1], "use_bias": true, "activity_regularizer": null}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_2/bias"}]}]}